module tstlay2;

import io.Console, text.convert.Layout;
import stdrus: пз;

    static if (is (typeof(Время)))
        import time.WallClock;

    проц main ()
    {
        auto выкладка = Выкладка!(сим).экземпляр;

        выкладка.преобразуй (Квывод.поток, "hi {}", "there\n");

        Квывод (выкладка.sprint (new сим[1], "hi")).нс;
        Квывод (выкладка.sprint (new сим[10], "{.4}", "hello")).нс;
        Квывод (выкладка.sprint (new сим[10], "{.-4}", "hello")).нс;

        Квывод (выкладка ("{:f1}", 3.0)).нс;
        Квывод (выкладка ("{:g}", 3.00)).нс;
        Квывод (выкладка ("{:f1}", -0.0)).нс;
        Квывод (выкладка ("{:g1}", -0.0)).нс;
        Квывод (выкладка ("{:d2}", 56)).нс;
        Квывод (выкладка ("{:d4}", cast(байт) -56)).нс;
        Квывод (выкладка ("{:f4}", 1.0e+12)).нс;
        Квывод (выкладка ("{:f4}", 1.23e-2)).нс;
        Квывод (выкладка ("{:f8}", 3.14159)).нс;
        Квывод (выкладка ("{:e20}", 1.23e-3)).нс;
        Квывод (выкладка ("{:e4.}", 1.23e-07)).нс;
        Квывод (выкладка ("{:.}", 1.2)).нс;
        Квывод (выкладка ("ptr:{}", &выкладка)).нс;
        Квывод (выкладка ("бдол.max {}", бдол.max)).нс;

        struct S
        {
            ткст вТкст ()
            {
                return "foo";
            }
        }

        S s;
        Квывод (выкладка ("struct: {}", s)).нс;

        static if (is (typeof(Время)))
            Квывод (выкладка ("время: {}", Куранты.сейчас)).нс;
			
		 пз;
    }