module mesht;
import math.linalg.Vector, mesh.Handles, mesh.Status, mesh.Utils;
import io.Stdout;

    alias Вектор!(плав,3) Век3п;
    alias Вектор!(плав,2) Век2п;
    alias Вектор!(цел,2) Век2ц;
    alias Вектор!(цел,3) Век3ц;
    alias Вектор!(ббайт,10) Век10бб;


проц вектТест()
{


    Век3п a;
    Век3п b =  [8,9,10];
    дво[] dyn = [7.0,6.0,3.0];
    Вектор!(дво,3) af = dyn;
    Вектор!(цел,3) ai;
    ai = [1,2,3];
    a = [1,2,3];
    
    Стдвыв.форматнс("A={}", a);
    Стдвыв.форматнс("Alen={}", a.нормаль);
    Стдвыв.форматнс("ai={}", ai);
    Стдвыв.форматнс("B={}", b);

    a = af;
}
проц main() {

вектТест();

    УкзНаВектор x = 10;
    auto y = УкзНаВектор(15);
    assert(фм(x.инд()) == "10");
    assert(фм(y.инд()) == "15");
    assert(x<y);
    assert(y>x);
    y.__инкремент();
    x.__декремент();
    assert(фм(x.инд()) == "9");
    assert(фм(y.инд()) == "16");

    УкзНаВектор z = x;
    assert(фм(z.инд()) == "9");
	
	ИнфОСтатусе i;
    i.установи_бит(БитыСтатуса.УДАЛЁН);
    assert(i.установлен_ли_бит(БитыСтатуса.УДАЛЁН));
    assert(i.удалён_ли());
	
	//SСтдвыв("Пора натыкаться на неприятное!").нс;
	    Век3п v = [.1f,.2,.3];
        Век3бб c = [0u,128,255];


        Стдвыв.форматнс("      v={}       c={}\n"
                 "cast(v)={} cast(c)={}", v,c, цветоКаст!(Век3бб)(v), цветоКаст!(Век3п)(c));
        Стдвыв.форматнс("      v=[{},{},{}]", v[0],v[1],v[2]);
	
    Стдвыв.форматнс("Всё отлично");
}