module io.protocol.EndianProtocol;

private import io.model;
private import  io.protocol.NativeProtocol;

extern(D)
 class ПротоколЭндиан : ПротоколНатив
{
        this (ИПровод провод, бул префикс=да);

        override проц[] читай (ук приёмн, бцел байты, Тип тип);

        override проц пиши (ук ист, бцел байты, Тип тип);
}


/*******************************************************************************

*******************************************************************************/

debug (UnitTest)
{
        import io.device.Array;

        unittest
        {
                проц[] размести (ПротоколЭндиан.Читатель читатель, бцел байты, ПротоколЭндиан.Тип тип)
                {
                        return читатель ((new проц[байты]).ptr, байты, тип);
                }
        
                ткст mule;
                ткст тест = "testing testing 123";
                
                auto протокол = new ПротоколЭндиан (new Массив(32));
                протокол.пишиМассив (тест.ptr, тест.length, протокол.Тип.Utf8);
                
                mule = cast(ткст) протокол.читайМассив (mule.ptr, mule.length, протокол.Тип.Utf8, &размести);
                assert (mule == тест);

        }
}





