module io.protocol.Reader;

private import  io.Buffer;
public  import  io.model, io.protocol.model;


/*******************************************************************************

        Читатель основа-class. Each читатель operates upon an ИБуфер, which is
        предоставленный at construction время. Читательs are simple converters of данные,
        и have reasonably rigопр rules regarding данные форматируй. Например,
        each request for данные expects the контент в_ be available; an исключение
        is thrown where this is not the case. If the данные is arranged in a ещё
        relaxed fashion, consider using ИБуфер directly instead.

        все readers support the full установи of исконный данные типы, plus a full
        выделение of Массив типы. The latter can be configured в_ произведи
        either a копируй (.dup) of the буфер контент, либо a срез. See classes
        КопияКучи, СрезБуфера и СрезКучи for ещё on this topic. Applications
        can disable память management by configuring a Читатель with one of the
        binary oriented protocols, и ensuring the optional протокол 'префикс'
        is disabled.

        Читательs support Java-esque получи() notation. However, the Dinrus
        стиль is в_ place IO элементы внутри their own parenthesis, like
        so:
        
        ---
        цел счёт;
        ткст verse;
        
        читай (verse) (счёт);
        ---

        Note that each элемент читай is distict; this стиль is affectionately
        known as "whisper". The код below illustrates basic operation upon a
        память буфер:
        
        ---
        auto буф = new Буфер (256);

        // карта same буфер преобр_в Всё читатель и писатель
        auto читай = new Читатель (буф);
        auto пиши = new Писатель (буф);

        цел i = 10;
        дол j = 20;
        дво d = 3.14159;
        ткст c = "fred";

        // пиши данные using whisper syntax
        пиши (c) (i) (j) (d);

        // читай them задний again
        читай (c) (i) (j) (d);


        // same thing again, but using помести() syntax instead
        пиши.помести(c).помести(i).помести(j).помести(d);
        читай.получи(c).получи(i).получи(j).получи(d);
        ---

        Note that certain protocols, such as the basic binary implementation, 
        expect в_ retrieve the число of Массив элементы из_ the исток. For
        example: when reading an Массив из_ a файл, the число of элементы 
        is читай из_ the файл also, и the configurable память-manager is
        invoked в_ предоставляет the Массив пространство. If контент is not arranged in
        such a manner you may читай Массив контент directly either by creating
        a Читатель with a протокол configured в_ sопрestep Массив-prefixing, or
        by accessing буфер контент directly (via the methods exposed there)
        e.g.

        ---
        проц[10] данные;
                
        читатель.буфер.заполни (данные);
        ---

        Читательs may also be использован with any class implementing the ИЧитаемое
        interface, along with any struct implementing an equivalent метод
        
*******************************************************************************/


extern(D):

 class Читатель : ИЧитатель
{       
	
        /***********************************************************************
        
                Construct a Читатель upon the предоставленный поток. We do our own
                протокол handling, equivalent в_ the ПротоколНатив. Массив
                allocation is supported via the куча

        ***********************************************************************/

        this (ИПотокВвода поток);

        /***********************************************************************

                Construct Читатель on the предоставленный протокол. This configures
                the IO conversion в_ be that of the протокол, but allocation
                of массивы is still handled by the куча
                
        ***********************************************************************/

        this (ИПротокол протокол);

        /***********************************************************************

                Устанавливает Массив разместитель, и протокол, для этого Читатель. See
                метод разместитель() for ещё инфо
                
        ***********************************************************************/

        this (ИРазместитель разместитель);

        /***********************************************************************
        
                Возвращает буфер associated with this читатель

        ***********************************************************************/

        final ИБуфер буфер ();
        
        /***********************************************************************       
        
                Get the разместитель в_ use for Массив management. Arrays are
                generally allocated by the ИЧитатель, via configured managers.
                A число of Разместитель classes are available в_ manage память
                when reading Массив контент. Alternatively, the application
                may obtain responsibility for allocation by selecting one of
                the ПротоколНатив deriviatives и настройка 'префикс' в_ be
                нет. The latter disables internal Массив management.

                Gaining доступ в_ the разместитель can expose some добавьitional
                controls. Например, some allocators benefit из_ a сбрось
                operation после each данные 'record' имеется been processed.

                By default, an ИЧитатель will размести each Массив из_ the 
                куча. You can change that by constructing the Читатель
                with an Разместитель of choice. For экземпляр, there is a
                СрезБуфера which will срез an Массив directly из_
                the буфер where possible. Also available is the record-
                oriented HeaoSlice, which slices память из_ внутри
                a pre-allocated куча area, и should be сбрось by the клиент
                код после each record имеется been читай (в_ avoопр unnecessary
                growth). 

                See module io.protocol.Allocator for ещё information

        ***********************************************************************/

        final ИРазместитель разместитель ();

        /***********************************************************************
        
                Extract a читаемый class из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (ИЧитатель.Клозура дг) ;

        /***********************************************************************
        
                Extract a читаемый class из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (ИЧитаемое x) ;

        /***********************************************************************

                Extract a булево значение из_ the текущ читай-позиция  
                
        ***********************************************************************/

        final ИЧитатель получи (inout бул x);

        /***********************************************************************

                Extract an unsigned байт значение из_ the текущ читай-позиция   
                                
        ***********************************************************************/

        final ИЧитатель получи (inout ббайт x) ;

        /***********************************************************************
        
                Extract a байт значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout байт x);

        /***********************************************************************
        
                Extract an unsigned крат значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout бкрат x);

        /***********************************************************************
        
                Extract a крат значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout крат x);

        /***********************************************************************
        
                Extract a unsigned цел значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout бцел x);

        /***********************************************************************
        
                Extract an цел значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout цел x);

        /***********************************************************************
        
                Extract an unsigned дол значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout бдол x);

        /***********************************************************************
        
                Extract a дол значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout дол x);

        /***********************************************************************
        
                Extract a плав значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout плав x);

        /***********************************************************************
        
                Extract a дво значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout дво x);

        /***********************************************************************
        
                Extract a реал значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout реал x);

        /***********************************************************************
        
                Extract a сим значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout сим x);

        /***********************************************************************
        
                Extract a wide сим значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout шим x);

        /***********************************************************************
        
                Extract a дво сим значение из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout дим x);

        /***********************************************************************

                Extract an булево Массив из_ the текущ читай-позиция   
                                
        ***********************************************************************/

        final ИЧитатель получи (inout бул[] x) ;

        /***********************************************************************

                Extract an unsigned байт Массив из_ the текущ читай-позиция   
                                
        ***********************************************************************/

        final ИЧитатель получи (inout ббайт[] x) ;

        /***********************************************************************
        
                Extract a байт Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout байт[] x);
        /***********************************************************************
        
                Extract an unsigned крат Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout бкрат[] x);

        /***********************************************************************
        
                Extract a крат Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout крат[] x);

        /***********************************************************************
        
                Extract a unsigned цел Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout бцел[] x);

        /***********************************************************************
        
                Extract an цел Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout цел[] x);

        /***********************************************************************
        
                Extract an unsigned дол Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout бдол[] x);

        /***********************************************************************
        
                Extract a дол Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout дол[] x);

        /***********************************************************************
        
                Extract a плав Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout плав[] x);

        /***********************************************************************
        
                Extract a дво Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout дво[] x);

        /***********************************************************************
        
                Extract a реал Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout реал[] x);

        /***********************************************************************
        
                Extract a сим Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout ткст x);

        /***********************************************************************
        
                Extract a шим Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout шим[] x);

        /***********************************************************************
        
                Extract a дим Массив из_ the текущ читай-позиция
                
        ***********************************************************************/

        final ИЧитатель получи (inout дим[] x);


        
        /***********************************************************************
        
        ***********************************************************************/

       // private ИЧитатель загрузиМассив (проц[]* x, бцел ширина, ИПротокол.Тип тип);
        
        /***********************************************************************

        ***********************************************************************/

       // private проц[] размести (ИПротокол.Читатель читатель, бцел байты, ИПротокол.Тип тип);

        /***********************************************************************

        ***********************************************************************/

      //  private проц[] читайЭлемент (ук приёмн, бцел байты, ИПротокол.Тип тип);
        
        /***********************************************************************

        ***********************************************************************/

      //  private проц[] читайМассив (ук приёмн, бцел байты, ИПротокол.Тип тип, ИПротокол.Разместитель размести);
}
                