/*******************************************************************************
        This module реализует the MD5 Message Дайджест Algorithm as described
        by RFC 1321 The MD5 Message-Дайджест Algorithm. R. Rivest. April 1992.

*******************************************************************************/
module crypto.digest.Md5;

public  import crypto.digest.Md4;
private import crypto.digest.MerkleDamgard;

/*******************************************************************************

*******************************************************************************/

extern(D) final class Мд5 : Мд4
{
        /***********************************************************************

                Конструирует Мд5

        ***********************************************************************/

        this() ;


        /***********************************************************************

                Performs the cipher on a блок of данные

                Параметры:
                данные = the блок of данные в_ cipher

                Примечания:
                The actual cipher algorithm is carried out by this метод on
                the passed блок of данные. This метод is called for every
                размерБлока() байты of ввод данные и once ещё with the остаток
                данные псеп_в_конце в_ размерБлока().

        ***********************************************************************/

        protected override проц трансформируй(ббайт[] ввод);


}