/*******************************************************************************

        This module реализует the SHA-1 Algorithm described by Secure Хэш
        Standard, FИПS PUB 180-1, и RFC 3174 US Secure Хэш Algorithm 1
        (SHA1). D. Eastlake 3rd, P. Jones. September 2001.

*******************************************************************************/

module crypto.digest.Sha1;

private import crypto.digest.Sha01;
public  import crypto.digest.Digest;

/*******************************************************************************

*******************************************************************************/

extern(D) final class Sha1 : Sha01
{
        /***********************************************************************

                Construct a Sha1 хэш algorithm контекст

        ***********************************************************************/
        
        this() ;

        /***********************************************************************

                Performs the cipher on a блок of данные

                Параметры:
                данные = the блок of данные в_ cipher

                Примечания:
                The actual cipher algorithm is carried out by this метод on
                the passed блок of данные. This метод is called for every
                размерБлока() байты of ввод данные и once ещё with the остаток
                данные псеп_в_конце в_ размерБлока().

        ***********************************************************************/

        final protected override проц трансформируй(ббайт[] ввод);
        /***********************************************************************

        ***********************************************************************/
        
        final static проц расширь (бцел[] W, бцел s);
        
}