module net.ftp.FtpClient;

private 
{
    import net.ftp.Telnet;
    import text.Util;
    import time.Clock;
    import text.Regex: Regex;
    import time.chrono.Gregorian;
    import tpl.array;
    import net.device.Socket;
    import io.device.Conduit;
    import io.device.Array;
    import io.device.File;

    import Текст = text.Util;
    import Ascii = text.Ascii;
    import Целое = text.convert.Integer;
    import Timestamp = text.convert.TimeStamp;
}

/******************************************************************************
 Делегат хода FTP.
 
 Сюда нужно добавить позицию рестарта и использование SIZE для определения
 процентности завершения.  Пока это представляет только число перемещёных
 байтов.
 
 Параметры:
 поз =                 текущее смещение в потоке
 ******************************************************************************/
alias проц delegate(in т_мера поз) ХодФтп;

/******************************************************************************
 Формат перемещаемых данных.
 ******************************************************************************/
enum ПФорматФтп 
{
    /**********************************************************************
     Указывает формат ASCII NON PRINT (окнчания строк преобразуются в CRLF.)
     **********************************************************************/
    аски,
    /**********************************************************************
     Указывает формат IMAGE (8-битные бинарные октеты.)
     **********************************************************************/
    образ,
}

/******************************************************************************
 Структура АдресФтп, содержащая всё необходимое для доступа к СоединениеФтп.
 ******************************************************************************/
struct АдресФтп 
{
    static АдресФтп* opCall(ткст стр);

    ткст адрес;
    ткст дир;
    ткст пользователь = "anonymous";
    ткст пароль = "anonymous@anonymous";
    бцел порт = 21;
}

/******************************************************************************
 Ответ сервера, состоящий из кода и потенциально многострочного сообщения.
 ******************************************************************************/
struct ОтветФтп 
{
    /**********************************************************************
     Код ответа.
     
     Цифры в этом коде ответа можно использовать для программного определения
     статуса.
     
     Первая Цифра (статус):
     1xx =             положительный, но предварительный, ответ
     2xx =             положительный ответ, указывающий на завершённость
     3xx =             положительный ответ, указывающий незавершённый статус
     4xx =             временный отрицательный ответ
     5xx =             постоянный отрицательный ответ
     
     Вторая Цифра (субъект):
     x0x =             условие, основанное на синтаксисе
     x1x =             информационное
     x2x =             соединение
     x3x =             аутентификация/процесс
     x5x =             файловая система
     **********************************************************************/
    сим[3] код = "000";

    /*********************************************************************
     Сообщение от сервера.
     
     With some responses, the сообщение may contain parseable information.
     For example, this is да of the 257 ответ.
     **********************************************************************/
    ткст сообщение = пусто;
}

/******************************************************************************
 Режим активного или пассивного соединения.
 ******************************************************************************/
enum ПТипСоединенияФтп 
{
    /**********************************************************************
     Активное - сервер подключен к клиенту по открытому порту.
     **********************************************************************/
    активное,
    /**********************************************************************
     Пассивное - сервер прослушивает соединение от клиента.
     **********************************************************************/
    пассивное,
}

/******************************************************************************
 Детали о данном подключении.
 
 Используется для корректной отправки команд PORT и PASV.
 ******************************************************************************/
struct ДеталиПодключенияФтп 
{
    /**********************************************************************
     Используемый тип.
     **********************************************************************/
    ПТипСоединенияФтп тип = ПТипСоединенияФтп.пассивное;

    /**********************************************************************
     Адрес, передаваемый серверу.
     **********************************************************************/
    Адрес адрес = пусто;

    /**********************************************************************
     Адрес, на котором идёт действительное прослушивание.
     **********************************************************************/
    Адрес слушай = пусто;
}

/******************************************************************************
 Поддерживаемое свойство сервера FTP.
 ******************************************************************************/
struct ЭлтФтп 
{
    /**********************************************************************
     Поддерживаемая команда, напр., SIZE.
     **********************************************************************/
    ткст команда = пусто;
    /**********************************************************************
     Параметры этой команды; напр., факты для MLST.
     **********************************************************************/
    ткст парамы = пусто;
}

/******************************************************************************
 The тип of a файл in an FTP listing.
 ******************************************************************************/
enum ПТипФайлаФтп 
{
    /**********************************************************************
     An неизвестное файл or тип (no тип fact.)
     **********************************************************************/
    неизвестное,
    /**********************************************************************
     A regular файл, либо similar.
     **********************************************************************/
    файл,
    /**********************************************************************
     The текущ дир (e.g. ., but not necessarily.)
     **********************************************************************/
    тдир,
    /**********************************************************************
     A предок дир (usually "..".)
     **********************************************************************/
    пдир,
    /**********************************************************************
     Any другой тип of дир.
     **********************************************************************/
    пап,
    /**********************************************************************
     другой тип of файл.  Consult the "тип" fact.
     **********************************************************************/
    другой,
}

/******************************************************************************
 Information about a файл in an FTP listing.
 ******************************************************************************/
struct ИнфОФайлеФтп 
{
    /**********************************************************************
     The имяф.
     **********************************************************************/
    ткст имя = пусто;
    /**********************************************************************
     Its тип.
     **********************************************************************/
    ПТипФайлаФтп тип = ПТипФайлаФтп.неизвестное;
    /**********************************************************************
     Размер в байтах (8 bit octets), либо бдол.max if not available.
     Since: 0.99.8
     **********************************************************************/
    бдол размер = бдол.max;
    /**********************************************************************
     Modification время, if available.
     **********************************************************************/
    Время изменён ;//= Время.макс();
    /**********************************************************************
     Creation время, if available (not often.)
     **********************************************************************/
    Время создан ;//= Время.макс();
    /**********************************************************************
     The файл's mime тип, if known.
     **********************************************************************/
    ткст майм = пусто;
    /***********************************************************************
     An associative Массив of все факты returned by the сервер, lowercased.
     ***********************************************************************/
    ткст[ткст] факты;
}

/*******************************************************************************
 Changed location Since: 0.99.8
 Documentation Pending
 *******************************************************************************/
class ИсклФтп: Исключение 
{
    сим[3] responseCode_ = "000";

    /***********************************************************************
     Construct an ИсклФтп based on a сообщение и код.
     
     Параметры:
     сообщение =         the исключение сообщение
     код =            the код (5xx for фатал ошибки)
     ***********************************************************************/
    this(ткст сообщение, сим[3] код = "420") ;

    /***********************************************************************
     Construct an ИсклФтп based on a ответ.
     
     Параметры:
     r =               the сервер ответ
     ***********************************************************************/
    this(ОтветФтп r);

    /***********************************************************************
     A ткст representation of the ошибка.
     ***********************************************************************/
    ткст вТкст();
}

/*******************************************************************************
 Seriously изменён Since: 0.99.8
 Documentation pending
 *******************************************************************************/
class СоединениеФтп: Telnet 
{

    ЭлтФтп[] supportedFeatures_ = пусто;
    ДеталиПодключенияФтп inf_;
    т_мера restartPos_ = 0;
    ткст currFile_ = "";
    Сокет dataСОКЕТ_;
    ИнтервалВремени timeout_ ;//= ИнтервалВремени.изМиллисек(5000);

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    public ИнтервалВремени таймаут();

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    public проц таймаут(ИнтервалВремени t) ;

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    public ИнтервалВремени времяШатдауна() ;

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    public ЭлтФтп[] поддерживаемыеВозможности() ;

    /***********************************************************************
     Изменено с версии: 0.99.8
     ***********************************************************************/
    проц исключение(ткст сообщение) ;

    /***********************************************************************
     Изменено с версии: 0.99.8
     ***********************************************************************/
    проц исключение(ОтветФтп fr) ;

    public this() ;

    public this(ткст имя_хоста, ткст ник = "anonymous",
            ткст пароль = "anonymous@anonymous", бцел порт = 21) ;

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    public this(АдресФтп fad) ;

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    public проц подключись(АдресФтп fad) ;

    /************************************************************************
     Изменено с версии: 0.99.8
     ************************************************************************/
    public проц подключись(ткст имя_хоста, ткст ник = "anonymous",
            ткст пароль = "anonymous@anonymous", бцел порт = 21);

    public проц закрой() ;

    public проц устПассив();

    public проц устАктив(ткст ИП, бкрат порт, ткст ип_прослушки = пусто,
            бкрат порт_прослушки = 0);

    public проц cd(ткст пап);

    public проц cdup() ;

    public ткст текрабпап() ;

    public проц chmod(ткст путь, цел режим);

    public проц del(ткст путь);

    public проц rm(ткст путь);

    public проц переименуй(ткст old_path, ткст new_path);

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    цел есть_ли(ткст файл) ;

    public т_мера размер(ткст путь, ПФорматФтп форматируй = ПФорматФтп.образ);

    public проц тип(ПФорматФтп форматируй) ;

    /***********************************************************************
     Добавлено с версии: 0.99.8
     ***********************************************************************/
    Время изменён(ткст файл);

    protected Время разборВремзнач(ткст значврем);

    public проц noop() ;

    public ткст mkdir(ткст путь);

    public проц дайВозможности() ;

    public проц шлиКоманду(ткст команда, ткст[] параметры...) ;

    public ОтветФтп читайОтвет(ткст ожидаемый_код) ;

    public ОтветФтп читайОтвет();

    protected ткст разбор257(ОтветФтп ответ);

    /*******************************************************************************
     Get a данные сокет из_ the сервер.
     
     This Отправкаs PASV/PORT as necessary.
     
     Возвращает:             the данные сокет or a listener
     Изменено с версии: 0.99.8
     *******************************************************************************/
    protected Сокет дайСокетДанных() ;

    /*******************************************************************************
     Отправка a PASV и initiate a connection.
     
     Возвращает:             a подключен сокет
     Изменено с версии: 0.99.8
     *******************************************************************************/
    public Сокет подключисьПассивно() ;

    /*
     Сокет сок = new Сокет();
     сок.подключись(connect_to);
     return сок;
     */

    public бул поддерживается(ткст команда);

    public бул поддерживается_ли(ткст команда) ;

    /*******************************************************************************
     Prepare a данные сокет for use.
     
     This modifies the сокет in some cases.
     
     Параметры:
     данные =            the данные listener сокет
     Изменено с версии: 0.99.8
     ********************************************************************************/
    protected проц подготовьСокетДанных(ref Сокет данные);

    /*****************************************************************************
     Изменено с версии: 0.99.8
     *****************************************************************************/
    public проц завершиКомандуДанных(Сокет данные) ;

    /*****************************************************************************
     Изменено с версии: 0.99.8
     *****************************************************************************/
    public Сокет обработайКомандуДанных(ткст команда, ткст[] параметры...);

    public ИнфОФайлеФтп[] ls(ткст путь = "");

    /*****************************************************************************
     Изменено с версии: 0.99.8
     *****************************************************************************/
    protected проц читайПоток(Сокет данные, ИПотокВывода поток,
            ХодФтп ход = пусто);

    /*****************************************************************************
     Изменено с версии: 0.99.8
     *****************************************************************************/
    protected проц шлиВПоток(Сокет данные, ИПотокВвода поток,
            ХодФтп ход = пусто);

    protected ИнфОФайлеФтп[] шлиКомандуСписок(ткст путь);

    protected ИнфОФайлеФтп разборСтрокиСписка(ткст строка) ;

    protected ИнфОФайлеФтп разборСтрокиМлст(ткст строка) ;

    public ИнфОФайлеФтп дайИнфОФайле(ткст путь);

    public проц помести(ткст путь, ткст локальн_файл,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /********************************************************************************
     Store данные из_ a поток on the сервер.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     поток =          данные в_ сохрани, либо пусто for a blank файл
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ шли the данные in
     ********************************************************************************/
    public проц помести(ткст путь, ИПотокВвода поток = пусто,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /********************************************************************************
     Доб данные в_ a файл on the сервер.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     поток =          данные в_ добавь в_ the файл
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ шли the данные in
     ********************************************************************************/
    public проц добавь(ткст путь, ИПотокВвода поток,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /*********************************************************************************
     Seek в_ a байт смещение for the следщ перемести.
     
     Параметры:
     смещение =          the число of байты в_ сместись вперёд
     **********************************************************************************/
    public проц рестартСик(т_мера смещение);

    /**********************************************************************************
     Размести пространство for a файл.
     
     After calling this, добавь() or помести() should be the следщ команда.
     
     Параметры:
     байты =           the число of байты в_ размести
     ***********************************************************************************/
    public проц размести(дол байты);

    /**********************************************************************************
     Retrieve a remote файл's contents преобр_в a local файл.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     локальн_файл =      the путь в_ the local файл
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ читай the данные in
     **********************************************************************************/
    public проц получи(ткст путь, ткст локальн_файл,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /*********************************************************************************
     Enable UTF8 on servers that don't use this as default. Might need some work
     *********************************************************************************/
    public проц активируйУТФ8() ;

    /**********************************************************************************
     Retrieve a remote файл's contents преобр_в a local файл.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     поток =          поток в_ пиши the данные в_
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ читай the данные in
     ***********************************************************************************/
    public проц получи(ткст путь, ИПотокВывода поток,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /*****************************************************************************
     Добавлено с версии: 0.99.8
     *****************************************************************************/
    public ИПотокВвода ввод(ткст путь) ;

    /*****************************************************************************
     Добавлено с версии: 0.99.8
     *****************************************************************************/
    public ИПотокВывода вывод(ткст путь) ;
}
