module net.http.HttpParams;

private import  time.Time;

private import  io.stream.Buffered;

private import  net.http.HttpTokens;

//private import  io.stream.Delimiters;

public  import  net.http.model.HttpParamsView;

/******************************************************************************

        Maintains набор of запрос параметры, разобрано из_ an HTTP request.
        Use ПараметрыППГТ instead for вывод параметры.

        Note that these ввод парамы may have been кодирован by the пользователь-
        agent. Unfortunately there имеется been little consensus on что that
        кодировка should be (especially regarding GET запрос-парамы). With
        luck, that will change в_ a consistent usage of UTF-8 внутри the 
        near future.

******************************************************************************/

class ПараметрыППГТ : ТокеныППГТ, ОбзорПараметровППГТ
{

        //private Разграничители!(сим) amp;

        /**********************************************************************
                
                Construct параметры by telling the СтэкППГТ that
                имя/значение pairs are seperated by a '=' character.

        **********************************************************************/

        this ();

        /**********************************************************************

                Возвращает число of заголовки

        **********************************************************************/

        бцел размер ();

        /**********************************************************************
                
                Чит все запрос параметры. Everything is mapped rather 
                than being allocated & copied

        **********************************************************************/

        override проц разбор (БуфВвод ввод);

        /**********************************************************************
                
                Добавь a имя/значение пара в_ the запрос список

        **********************************************************************/

        проц добавь (ткст имя, ткст значение);

        /**********************************************************************
                
                Добавь a имя/целое пара в_ the запрос список 

        **********************************************************************/

        проц добавьЦел (ткст имя, цел значение);


        /**********************************************************************
                
                Добавь a имя/дата(дол) пара в_ the запрос список

        **********************************************************************/

        проц добавьДату (ткст имя, Время значение);

        /**********************************************************************
                
                Возвращает значение of the provопрed заголовок, либо пусто if the
                заголовок does not есть_ли

        **********************************************************************/

        ткст получи (ткст имя, ткст возвр = пусто);

        /**********************************************************************
                
                Возвращает целое значение of the provопрed заголовок, либо the 
                provопрed default-значение if the заголовок does not есть_ли

        **********************************************************************/

        цел получиЦел (ткст имя, цел возвр = -1);

        /**********************************************************************
                
                Возвращает дата значение of the provопрed заголовок, либо the 
                provопрed default-значение if the заголовок does not есть_ли

        **********************************************************************/

        Время дайДату (ткст имя, Время возвр = Время.эпоха);


        /**********************************************************************

                Вывод the param список в_ the provопрed consumer

        **********************************************************************/

        проц произведи (т_мера delegate(проц[]) используй, ткст кс=пусто);
}
