/*******************************************************************************

    Этот модуль используется для раскодировки и кодировки гекс-массивов типа ткст.

    Пример:
    ---
    ткст blah = "Hello there, my имя is Jeff.";

    scope encodebuf = new сим[вычислиРазмерКодир(cast(ббайт[])blah)];
    ткст кодирован = кодируй(cast(ббайт[])blah, encodebuf);

    scope decodebuf = new ббайт[кодирован.length];
    if (cast(ткст)раскодируй(кодирован, decodebuf) == "Hello there, my имя is Jeff.")
        Стдвыв("yay").нс;
    ---

    Since v1.0

*******************************************************************************/

module crypto.Base16;

extern(D):

/*******************************************************************************

    Вычисляет и возвращает размер, необходимый для кодирования переданного
    Массива.

    Параметры:
    данные = Массив, который будет кодирован

*******************************************************************************/
 бцел вычислиРазмерКодир(ббайт[] данные);

/*******************************************************************************

    Вычисляет и возвращает размер, необходимый для кодирования переданной длины.

    Параметры:
    длина = Число кодируемых байтов.

*******************************************************************************/
бцел вычислиРазмерКодир(бцел длина);

/*******************************************************************************

    encodes данные и returns as an ASCII hex ткст.

    Параметры:
    данные = что is в_ be кодирован
    buff = буфер large enough в_ hold кодирован данные

    Example:
    ---
    сим[512] encodebuf;
    ткст myEncodedString = кодируй(cast(ббайт[])"Hello, как are you today?", encodebuf);
    Стдвыв(myEncodedString).нс; // 48656C6C6F2C20686F772061726520796F7520746F6461793F
    ---


*******************************************************************************/
ткст кодируй(ббайт[] данные, ткст буф);

/*******************************************************************************

    encodes данные и returns as an ASCII hex ткст.

    Параметры:
    данные = что is в_ be кодирован

    Example:
    ---
    ткст myEncodedString = кодируй(cast(ббайт[])"Hello, как are you today?");
    Стдвыв(myEncodedString).нс; // 48656C6C6F2C20686F772061726520796F7520746F6461793F
    ---


*******************************************************************************/
 ткст кодируй(ббайт[] данные);

/*******************************************************************************

    decodes an ASCII hex ткст и returns it as ббайт[] данные. Pre-allocates
    the размер of the Массив.

    This decoder will ignore non-hex characters. So:
    SGVsbG8sIGhvd
    yBhcmUgeW91IH
    RvZGF5Pw==

    Is действителен.

    Параметры:
    данные = что is в_ be decoded

    Example:
    ---
    ткст myDecodedString = cast(ткст)раскодируй("48656C6C6F2C20686F772061726520796F7520746F6461793F");
    Стдвыв(myDecodeString).нс; // Hello, как are you today?
    ---

*******************************************************************************/
 ббайт[] раскодируй(ткст данные);

/*******************************************************************************

    decodes an ASCII hex ткст и returns it as ббайт[] данные.

    This decoder will ignore non-hex characters. So:
    SGVsbG8sIGhvd
    yBhcmUgeW91IH
    RvZGF5Pw==

    Is действителен.

    Параметры:
    данные = что is в_ be decoded
    buff = a big enough Массив в_ hold the decoded данные

    Example:
    ---
    ббайт[512] decodebuf;
    ткст myDecodedString = cast(ткст)раскодируй("48656C6C6F2C20686F772061726520796F7520746F6461793F", decodebuf);
    Стдвыв(myDecodeString).нс; // Hello, как are you today?
    ---

*******************************************************************************/
 ббайт[] раскодируй(ткст данные, ббайт[] буф);