module net.http.HttpGet;

public import   net.Uri, io.stream.Buffered;

private import  net.http.HttpClient,
        net.http.HttpHeaders;

/*******************************************************************************

        Supports the basic needs of a клиент making requests of an HTTP
        сервер. The following is a usage example:
        ---
        // открой a web-страница for reading (see ПостППГТ for writing)
        auto страница = new ГетППГТ ("http://www.digitalmars.com/d/intro.html");

        // retrieve и слей display контент
        Квывод (cast(ткст) страница.читай) ();
        ---

*******************************************************************************/

export class ГетППГТ : КлиентППГТ
{

    /***********************************************************************

            Создаёт клиент для заданного URL. The аргумент should be
            fully qualified with an "http:" or "https:" схема, либо an
            явный порт should be предоставленный.

    ***********************************************************************/

    export this (ткст url)
    {
        this (new Уир(url));
    }

    /***********************************************************************

            Создаёт клиент with the предоставленный Уир экземпляр. The Уир should
            be fully qualified with an "http:" or "https:" схема, либо an
            явный порт should be предоставленный.

    ***********************************************************************/

    export this (Уир уир)
    {
        super (КлиентППГТ.Взять, уир);

        // активируй заголовок duplication
        дайЗаголовкиОтвета.retain (да);
    }

    /***********************************************************************

    ***********************************************************************/

    export проц[] читай ()
    {
        auto буфер = cast(БуфВвод) super.открой;
        try
        {
            if (super.ответОК_ли)
                буфер.загрузи (дайЗаголовкиОтвета.получиЦел(ЗаголовокППГТ.ДлинаКонтента));
        }
        finally {super.закрой;}
        return буфер.срез;
    }
}


/*******************************************************************************

*******************************************************************************/

debug (ГетППГТ)
{
    import io.Console;

    проц main()
    {
        // открой a web-страница for reading (see ПостППГТ for writing)
        auto страница = new ГетППГТ ("http://www.digitalmars.com/d/intro.html");

        // retrieve и слей display контент
        Квывод (cast(ткст) страница.читай) ();

        foreach (заголовок; страница.дайЗаголовкиОтвета)
        Квывод (заголовок.имя.значение) (заголовок.значение).нс;
    }
}
