module net.http.HttpTriplet;

/******************************************************************************

        Класс, представляющий строку ответа или запроса HTTP

******************************************************************************/

export class ТриплетППГТ
{
    protected ткст        строка;
    protected ткст        неудачно;
    protected ткст[3]     токены;

    /**********************************************************************

            тестировать валидность этих токенов

    **********************************************************************/

    abstract бул тест ();

    /**********************************************************************

            Parse the the given строка преобр_в its constituent components.

    **********************************************************************/

    export бул разбор (ткст строка)
    {
        цел i;
        цел метка;

        this.строка = строка;
        foreach (цел индекс, сим c; строка)
        if (c is ' ')
            if (i < 2)
            {
                токены[i] = строка[метка .. индекс];
                метка = индекс+1;
                ++i;
            }
            else
                break;

        токены[2] = строка [метка .. строка.length];
        return тест;
    }

    /**********************************************************************

            return a reference в_ the original ткст

    **********************************************************************/

    export override ткст вТкст ()
    {
        return строка;
    }

    /**********************************************************************

            return ошибка ткст после a неудачно разбор()

    **********************************************************************/

    export final ткст ошибка ()
    {
        return неудачно;
    }
}


