module io.protocol.Writer;

private import  io.Buffer;

public  import             io.model;

public  import  io.protocol.model;


/*******************************************************************************

        Писатель основа-class. Writers предоставляет the means в_ добавь formatted
        данные в_ an ИБуфер, и expose a convenient метод of handling a
        variety of данные типы. In добавьition в_ writing исконный типы such
        as целое и ткст, writers also process any class which имеется
        implemented the ИЗаписываемое interface (one метод).

        все writers support the full установи of исконный данные типы, plus their
        fundamental Массив variants. Operations may be chained задний-в_-задний.

        Writers support a Java-esque помести() notation. However, the Dinrus стиль
        is в_ place IO элементы внутри their own parenthesis, like so:

        ---
        пиши (счёт) (" green bottles");
        ---

        Note that each записано элемент is distict; this стиль is affectionately
        known as "whisper". The код below illustrates basic operation upon a
        память буфер:

        ---
        auto буф = new Буфер (256);

        // карта same буфер преобр_в Всё читатель и писатель
        auto читай = new Читатель (буф);
        auto пиши = new Писатель (буф);

        цел i = 10;
        дол j = 20;
        дво d = 3.14159;
        ткст c = "fred";

        // пиши данные типы out
        пиши (c) (i) (j) (d);

        // читай them задний again
        читай (c) (i) (j) (d);


        // same thing again, but using помести() syntax instead
        пиши.помести(c).помести(i).помести(j).помести(d);
        читай.получи(c).получи(i).получи(j).получи(d);
        ---

        Writers may also be использован with any class implementing the ИЗаписываемое
        interface, along with any struct implementing an equivalent function.

*******************************************************************************/


extern(D) class Писатель : ИПисатель
{

    /***********************************************************************

            Construct a Писатель on the предоставленный Protocol

    ***********************************************************************/

    this (ИПротокол протокол);

    /***********************************************************************

            Construct a Писатель on the given ИПотокВывода. We do our own
            протокол handling, equivalent в_ the ПротоколНатив.

    ***********************************************************************/

    this (ИПотокВывода поток);

    /***********************************************************************

            Return the associated буфер

    ***********************************************************************/

    final ИБуфер буфер ();

    /***********************************************************************

            Emit a нс

    ***********************************************************************/

    ИПисатель нс ();

    /***********************************************************************

            Устанавливает нс sequence

    ***********************************************************************/

    ИПисатель нс (ткст кс);

    /***********************************************************************

            Flush the вывод of this писатель и return a chaining ref

    ***********************************************************************/

    final ИПисатель слей ();

    /***********************************************************************

            Flush this писатель. This is a convenience метод использован by
            the "whisper" syntax.

    ***********************************************************************/

    final ИПисатель помести ();

    /***********************************************************************

            Зап via a delegate в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (ИПисатель.Клозура дг);

    /***********************************************************************

            Зап a class в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (ИЗаписываемое x);

    /***********************************************************************

            Зап a булево значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бул x);

    /***********************************************************************

            Зап an unsigned байт значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (ббайт x);

    /***********************************************************************

            Зап a байт значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (байт x);

    /***********************************************************************

            Зап an unsigned крат значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бкрат x);

    /***********************************************************************

            Зап a крат значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (крат x);

    /***********************************************************************

            Зап a unsigned цел значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бцел x);

    /***********************************************************************

            Зап an цел значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (цел x);

    /***********************************************************************

            Зап an unsigned дол значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бдол x);

    /***********************************************************************

            Зап a дол значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (дол x);

    /***********************************************************************

            Зап a плав значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (плав x);

    /***********************************************************************

            Зап a дво значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (дво x);

    /***********************************************************************

            Зап a реал значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (реал x);

    /***********************************************************************

            Зап a сим значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (сим x);

    /***********************************************************************

            Зап a шим значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (шим x);

    /***********************************************************************

            Зап a дим значение в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (дим x);

    /***********************************************************************

            Зап a булево Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бул[] x);

    /***********************************************************************

            Зап a байт Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (байт[] x);

    /***********************************************************************

            Зап an unsigned байт Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (ббайт[] x);

    /***********************************************************************

            Зап a крат Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (крат[] x);

    /***********************************************************************

            Зап an unsigned крат Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бкрат[] x);

    /***********************************************************************

            Зап an цел Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (цел[] x);

    /***********************************************************************

            Зап an unsigned цел Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бцел[] x);

    /***********************************************************************

            Зап a дол Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (дол[] x);

    /***********************************************************************

            Зап an unsigned дол Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (бдол[] x);

    /***********************************************************************

            Зап a плав Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (плав[] x);

    /***********************************************************************

            Зап a дво Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (дво[] x);

    /***********************************************************************

            Зап a реал Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (реал[] x);

    /***********************************************************************

            Зап a сим Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (ткст x);

    /***********************************************************************

            Зап a шим Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (шим[] x);

    /***********************************************************************

            Зап a дим Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    final ИПисатель помести (дим[] x);

    /***********************************************************************

            Dump Массив контент преобр_в the буфер. Note that the default
            behaviour is в_ префикс with the Массив байт счёт

    ***********************************************************************/

   // private проц пишиМассив (ук ист, бцел байты, ИПротокол.Тип тип);

    /***********************************************************************

            Dump контент преобр_в the буфер

    ***********************************************************************/

   // private проц пишиЭлемент (ук ист, бцел байты, ИПротокол.Тип тип);
}
