/*******************************************************************************

        Эти классы представляют простые средства чтения и записи
        дискретных типов данных как двоичных значений, с опцией инвертировать
        эндианный порядок у числовых значений.

        Arrays are treated as untyped байт Потокs, with an optional
        length-префикс, and should иначе be explicitly managed at
        the application уровень. We'll добавь добавьitional support for массивы
        and aggregates in future.

*******************************************************************************/

module io.stream.Data;

private import stdrus :ПерестановкаБайт;

private import io.device.Conduit;

private import io.stream.Buffered;

/*******************************************************************************

        Простой способ чтения бинарных данных из произвольного ИПотокВвода,
        такого как файл:
        ---
        auto ввод = new ВводДанных (new Файл ("путь"));
        auto x = ввод.цел32;
        auto y = ввод.плав64;
        auto l = ввод.читай (буфер);           // прямое чтение необр данных
        auto s = cast(ткст) ввод.массив;      // читай length, размести пространство
        ввод.закрой;
        ---

*******************************************************************************/
extern(D):

class ВводДанных : ФильтрВвода
{
        public alias массив     получи;             /// old имя alias
        public alias булево   получиБул;         /// описано ранее
        public alias цел8      получиБайт;         /// описано ранее
        public alias цел16     получиКрат;        /// описано ранее
        public alias цел32     получиЦел;          /// описано ранее
        public alias цел64     получиДол;         /// описано ранее
        public alias плав32   получиПлав;        /// описано ранее
        public alias плав64   получиДво;       /// описано ранее

        public enum                             /// эндиан variations
        {
                Натив  = 0,
                Сеть = 1,
                Биг     = 1,
                Литл  = 2
        }

        private бул            флип;
        protected ИПотокВвода   ввод;
        private Размести        разместитель;

        private alias проц[] delegate (бцел) Размести;

        /***********************************************************************

                Продвижение конструктора в суперкласс

        ***********************************************************************/

        this (ИПотокВвода поток);

        /***********************************************************************

                Установка разместителя массива

        ***********************************************************************/

        final ВводДанных размести (Размести размести);

        /***********************************************************************

                Установка трансляции текущей эндианности

        ***********************************************************************/

        final ВводДанных эндиан (цел e);

        /***********************************************************************

                Чтен an массив задний преобр_в a пользователь-предоставленный workspace. The
                пространство must be sufficiently large enough в_ house все of
                the массив, and the actual число of байты is returned.

                Note that the размер of the массив is записано как целое
                prefixing the массив контент itself.  Use читай(проц[]) в_ 
                eschew this префикс.

        ***********************************************************************/
        
        final бцел массив (проц[] приёмн);

        /***********************************************************************

                Чтен an массив задний из_ the исток, with the assumption
                it есть been записано using ВыводДанных.помести() or иначе
                псеп_в_начале with an целое representing the total число
                of байты within the массив контент. That's *байты*, not
                elements.

                An массив of the appropriate размер is allocated either via
                the предоставленный delegate, либо из_ the куча, populated and
                returned в_ the caller. Casting the return значение в_ an
                appropriate тип will исправь the число of elements as
                required:
                ---
                auto текст = cast(ткст) ввод.получи;
                ---
                
        ***********************************************************************/

        final проц[] массив ();

        /***********************************************************************

        ***********************************************************************/

        final бул булево ();

        /***********************************************************************

        ***********************************************************************/

        final байт цел8 ();

        /***********************************************************************

        ***********************************************************************/

        final крат цел16 ();

        /***********************************************************************

        ***********************************************************************/

        final цел цел32 ();

        /***********************************************************************

        ***********************************************************************/

        final дол цел64 ();

        /***********************************************************************

        ***********************************************************************/

        final плав плав32 ();

        /***********************************************************************

        ***********************************************************************/

        final дво плав64 ();

        /***********************************************************************

        ***********************************************************************/

        final override т_мера читай (проц[] данные);

        /***********************************************************************

        ***********************************************************************/

        private final проц съешь (ук  приёмн, т_мера байты);
}


/*******************************************************************************

        A simple way в_ пиши binary данные в_ an arbitrary ИПотокВывода,
        such как файл:
        ---
        auto вывод = new ВыводДанных (new Файл ("путь", Файл.ЗапСозд));
        вывод.цел32   (1024);
        вывод.плав64 (3.14159);
        вывод.массив   ("ткст with length префикс");
        вывод.пиши   ("необр массив, no префикс");
        вывод.закрой;
        ---

*******************************************************************************/

class ВыводДанных : ФильтрВывода
{       
        public alias массив      помести;            /// old имя alias
        public alias булево    поместиБул;        /// описано ранее
        public alias цел8       поместиБайт;        /// описано ранее
        public alias цел16      поместиКрат;       /// описано ранее
        public alias цел32      поместиЦел;         /// описано ранее
        public alias цел64      поместиДол;        /// описано ранее
        public alias плав32    поместиПлав;       /// описано ранее
        public alias плав64    поместиПлав;       /// описано ранее

        public enum                             /// эндиан variations
        {
                Натив  = 0,
                Сеть = 1,
                Биг     = 1,
                Литл  = 2
        }

       // private бул            флип;
       // private ИПотокВывода    вывод;

        /***********************************************************************

                Распространить конструктор на суперкласс.

        ***********************************************************************/

        this (ИПотокВывода поток);

        /***********************************************************************

                Набор current эндиан translation

        ***********************************************************************/

        final ВыводДанных эндиан (цел e);

        /***********************************************************************

                Write an массив в_ the мишень поток. Note that the размер 
                of the массив is записано как целое prefixing the массив 
                контент itself. Use пиши(проц[]) в_ eschew this префикс.

        ***********************************************************************/

        final бцел массив (проц[] ист);

        /***********************************************************************

        ***********************************************************************/

        final проц булево (бул x);

        /***********************************************************************

        ***********************************************************************/

        final проц цел8 (байт x);

        /***********************************************************************

        ***********************************************************************/

        final проц цел16 (крат x);

        /***********************************************************************

        ***********************************************************************/

        final проц цел32 (цел x);

        /***********************************************************************

        ***********************************************************************/

        final проц цел64 (дол x);

        /***********************************************************************

        ***********************************************************************/

        final проц плав32 (плав x);

        /***********************************************************************

        ***********************************************************************/

        final проц плав64 (дво x);

        /***********************************************************************

        ***********************************************************************/

        final override т_мера пиши (проц[] данные);

        /***********************************************************************

        ***********************************************************************/

       // private final проц съешь (ук  ист, т_мера байты);
}


/*******************************************************************************

*******************************************************************************/

debug (UnitTest)
{
        import io.device.Array;

        unittest
        {
                auto буф = new массив(32);

                auto вывод = new ВыводДанных (буф);
                вывод.массив ("blah blah");
                вывод.цел32 (1024);

                auto ввод = new ВводДанных (буф);
                assert (ввод.массив(new сим[9]) is 9);
                assert (ввод.цел32 is 1024);
        }
}


/*******************************************************************************

*******************************************************************************/

debug (Данные)
{
        import io.device.Array;

        проц main()
        {
                auto буф = new массив(64);

                auto вывод = new ВыводДанных (буф);
                вывод.массив ("blah blah");
                вывод.цел32 (1024);

                auto ввод = new ВводДанных (буф);
                assert (ввод.массив.length is 9);
                assert (ввод.цел32 is 1024);
        }
}
