
module io.stream.DataFile;

private import io.device.File;

private import io.stream.Data;

/*******************************************************************************

        Composes a seekable файл with buffered binary ввод. A сместись causes
        the ввод буфер в_ be cleared

*******************************************************************************/

extern(D):

 class ВводФайлаДанных : ВводДанных
{
   // private Файл провод;

    /***********************************************************************

            Compose a FileStream

    ***********************************************************************/

    this (ткст путь, Файл.Стиль стиль = Файл.ЧитСущ);

    /***********************************************************************

            Wrap a Файл экземпляр

    ***********************************************************************/

    this (Файл файл);

    /***********************************************************************

            Возвращает underlying провод

    ***********************************************************************/

    final Файл файл ();
}


/*******************************************************************************

        Composes a seekable файл with buffered binary вывод. A сместись causes
        the буфер вывода в_ be flushed first

*******************************************************************************/

class ВыводФайлаДанных : ВыводДанных
{
   // private Файл провод;

    /***********************************************************************

            Compose a FileStream

    ***********************************************************************/

    this (ткст путь, Файл.Стиль стиль = Файл.ЗапСозд);

    /***********************************************************************

            Wrap a FileConduit экземпляр

    ***********************************************************************/

    this (Файл файл);

    /***********************************************************************

            Возвращает underlying провод

    ***********************************************************************/

    final Файл файл ();
}

debug (DataFile)
{
    import io.Stdout;
	import io.stream.DataFile;

    проц main()
    {
        auto myFile = new ВыводФайлаДанных("Hello.txt");
        myFile.пиши("some текст");
        myFile.слей;
        Стдвыв.форматнс ("{}:{}", myFile.файл.позиция, myFile.сместись(myFile.Якорь.Тек));
    }
}
