module io.protocol.Writer;

private import  io.Buffer;
public  import  io.model, io.protocol.model;

export class Писатель : ИПисатель
{


    // the буфер associated with this писатель. Note that this
    // should not change over the lifetime of the читатель, since
    // it is assumed в_ be immutable elsewhere
    package ИБуфер                 буфер_;

    package ИПротокол.ПисательМассива   массивы;
    package ИПротокол.Писатель        элементы;

    // конец of строка sequence
    package ткст                  кс = ФайлКонст.НовСтрЗнак;

    /***********************************************************************

            Construct a Писатель on the предоставленный Protocol

    ***********************************************************************/
export this (ИПротокол протокол)
    {
        буфер_ = протокол.буфер;
        элементы = &протокол.пиши;
        массивы = &протокол.пишиМассив;
    }

    /***********************************************************************

            Construct a Писатель on the given ИПотокВывода. We do our own
            протокол handling, equivalent в_ the ПротоколНатив.

    ***********************************************************************/

    export this (ИПотокВывода поток)
    {
        auto b = cast(ИБуферированный) поток;
        буфер_ = b ? b.буфер() : объБуфер(поток.провод);

        массивы = &пишиМассив;
        элементы = &пишиЭлемент;
    }

    /***********************************************************************

            Возвращает associated буфер

    ***********************************************************************/

    export final ИБуфер буфер ()
    {
        return буфер_;
    }

    /***********************************************************************

            Emit a нс

    ***********************************************************************/

    export ИПисатель нс ()
    {
        return помести (кс);
    }

    /***********************************************************************

            Устанавливает нс sequence

    ***********************************************************************/

    export ИПисатель нс (ткст кс)
    {
        this.кс = кс;
        return this;
    }

    /***********************************************************************

            Flush the вывод of this писатель и return a chaining ref

    ***********************************************************************/

    export final ИПисатель слей ()
    {
        буфер_.слей;
        return this;
    }

    /***********************************************************************

            Flush this писатель. This is a convenience метод использован by
            the "whisper" syntax.

    ***********************************************************************/

    export final ИПисатель помести ()
    {
        return слей;
    }

    /***********************************************************************

            Зап via a delegate в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (ИПисатель.Клозура дг)
    {
        дг (this);
        return this;
    }

    /***********************************************************************

            Зап a class в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (ИЗаписываемое x)
    {
        if (x is пусто)
            буфер_.ошибка ("Писатель.помести :: attempt в_ пиши a пусто ИЗаписываемое объект");

        return помести (&x.пиши);
    }

    /***********************************************************************

            Зап a булево значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бул x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Bool);
        return this;
    }

    /***********************************************************************

            Зап an unsigned байт значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (ббайт x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.UByte);
        return this;
    }

    /***********************************************************************

            Зап a байт значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (байт x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Byte);
        return this;
    }

    /***********************************************************************

            Зап an unsigned крат значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бкрат x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.UShort);
        return this;
    }

    /***********************************************************************

            Зап a крат значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (крат x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Short);
        return this;
    }

    /***********************************************************************

            Зап a unsigned цел значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бцел x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.UInt);
        return this;
    }

    /***********************************************************************

            Зап an цел значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (цел x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Int);
        return this;
    }

    /***********************************************************************

            Зап an unsigned дол значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бдол x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.ULong);
        return this;
    }

    /***********************************************************************

            Зап a дол значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (дол x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Long);
        return this;
    }

    /***********************************************************************

            Зап a плав значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (плав x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Float);
        return this;
    }

    /***********************************************************************

            Зап a дво значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (дво x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Double);
        return this;
    }

    /***********************************************************************

            Зап a реал значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (реал x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Real);
        return this;
    }

    /***********************************************************************

            Зап a сим значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (сим x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Utf8);
        return this;
    }

    /***********************************************************************

            Зап a шим значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (шим x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Utf16);
        return this;
    }

    /***********************************************************************

            Зап a дим значение в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (дим x)
    {
        элементы (&x, x.sizeof, ИПротокол.Тип.Utf32);
        return this;
    }

    /***********************************************************************

            Зап a булево Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бул[] x)
    {
        массивы (x.ptr, x.length * бул.sizeof, ИПротокол.Тип.Bool);
        return this;
    }

    /***********************************************************************

            Зап a байт Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (байт[] x)
    {
        массивы (x.ptr, x.length * байт.sizeof, ИПротокол.Тип.Byte);
        return this;
    }

    /***********************************************************************

            Зап an unsigned байт Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (ббайт[] x)
    {
        массивы (x.ptr, x.length * ббайт.sizeof, ИПротокол.Тип.UByte);
        return this;
    }

    /***********************************************************************

            Зап a крат Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (крат[] x)
    {
        массивы (x.ptr, x.length * крат.sizeof, ИПротокол.Тип.Short);
        return this;
    }

    /***********************************************************************

            Зап an unsigned крат Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бкрат[] x)
    {
        массивы (x.ptr, x.length * бкрат.sizeof, ИПротокол.Тип.UShort);
        return this;
    }

    /***********************************************************************

            Зап an цел Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (цел[] x)
    {
        массивы (x.ptr, x.length * цел.sizeof, ИПротокол.Тип.Int);
        return this;
    }

    /***********************************************************************

            Зап an unsigned цел Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бцел[] x)
    {
        массивы (x.ptr, x.length * бцел.sizeof, ИПротокол.Тип.UInt);
        return this;
    }

    /***********************************************************************

            Зап a дол Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (дол[] x)
    {
        массивы (x.ptr, x.length * дол.sizeof, ИПротокол.Тип.Long);
        return this;
    }

    /***********************************************************************

            Зап an unsigned дол Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (бдол[] x)
    {
        массивы (x.ptr, x.length * бдол.sizeof, ИПротокол.Тип.ULong);
        return this;
    }

    /***********************************************************************

            Зап a плав Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (плав[] x)
    {
        массивы (x.ptr, x.length * плав.sizeof, ИПротокол.Тип.Float);
        return this;
    }

    /***********************************************************************

            Зап a дво Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (дво[] x)
    {
        массивы (x.ptr, x.length * дво.sizeof, ИПротокол.Тип.Double);
        return this;
    }

    /***********************************************************************

            Зап a реал Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (реал[] x)
    {
        массивы (x.ptr, x.length * реал.sizeof, ИПротокол.Тип.Real);
        return this;
    }

    /***********************************************************************

            Зап a сим Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (ткст x)
    {
        массивы (x.ptr, x.length * сим.sizeof, ИПротокол.Тип.Utf8);
        return this;
    }

    /***********************************************************************

            Зап a шим Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (шим[] x)
    {
        массивы (x.ptr, x.length * шим.sizeof, ИПротокол.Тип.Utf16);
        return this;
    }

    /***********************************************************************

            Зап a дим Массив в_ the текущ буфер-позиция

    ***********************************************************************/

    export final ИПисатель помести (дим[] x)
    {
        массивы (x.ptr, x.length * дим.sizeof, ИПротокол.Тип.Utf32);
        return this;
    }

    /***********************************************************************

            Dump Массив контент преобр_в the буфер. Note that the default
            behaviour is в_ префикс with the Массив байт счёт

    ***********************************************************************/

    export  проц пишиМассив (ук ист, бцел байты, ИПротокол.Тип тип)
    {
        помести (байты);
        пишиЭлемент (ист, байты, тип);
    }

    /***********************************************************************

            Dump контент преобр_в the буфер

    ***********************************************************************/

    export  проц пишиЭлемент (ук ист, бцел байты, ИПротокол.Тип тип)
    {
        буфер_.добавь (ист [0 .. байты]);
    }
}
