
module wx.DataFormat;
public import wx.common;

public enum ПИдФорматаДаты
{
    Неверный =          0,
    Текст =             1,
    Битмап =           2,
    Метафайл =         3,
    Силк =             4,//SYLK
    Диф =              5,
    Тифф =             6,
    ТекстОЕМ =          7,
    Диб =              8,
    Палитра =          9,
    ДанныеПера =          10,
    Рифф =             11,
    Вав =             12,
    ТекстЮникод =      13,
    ENHMETAFILE =      14,
    Имяф =         15,
    Локаль =           16,
    Приват =          20,
    Гяр =             30,
    Макс
}

//-----------------------------------------------------------------------------

extern(D) class ФорматДаты : ВизОбъект
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public  this();
    public this(ПИдФорматаДаты тип);
    public this(ткст ид);
    ~this();
    public ткст ид();
    public проц ид(ткст значение);
    public ПИдФорматаДаты тип();
    public проц тип(ПИдФорматаДаты значение);
}

