module wx.DataObject;
public import wx.common;
public import wx.ArrayString;

extern(D)  abstract class ОбъектДанных : ВизОбъект
{
    public enum ПНаправлениеДанных
    {
        Получить = 0x01,
        Установить = 0x02,
        Оба = 0x03
    }
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    ~this();
}

//---------------------------------------------------------------------

extern(D) class ПростойОбъектДанных : ОбъектДанных
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    ~this();
}

//---------------------------------------------------------------------

extern(D) class ОбъектТекстДанных : ПростойОбъектДанных
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public this();
    public this(ткст текст);
    ~this();
    public цел длинаТкста();
    public ткст текст();
    public проц текст(ткст значение);
}
//---------------------------------------------------------------------

extern(D) class ОбъектФайлДанных : ПростойОбъектДанных
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public this();
    ~this();
    public проц добавьФайл(ткст имяф);
    public ткст[] именаФайлов();

}
