module wx.Dialog;
public import wx.common;
public import wx.Window;

//---------------------------------------------------------------------

/// A dialog бокс is a окно with a титул bar and sometimes a
/// system меню, который can be moved around the screen. It can contain
/// controls and другой windows and is usually used до разрешить the user
/// до make some choice or до answer a question.
extern(D) class Диалог : Окно
{
    enum
    {
        ЦЕНТР		= 0x00000001,
        ДА			= 0x00000002,
        ОК			= 0x00000004,
        НЕТ			= 0x00000008,
        ОТМЕНА		= 0x00000010,
        ДАНЕТ		= (ДА | НЕТ),

        ДЕФДА		= 0x00000000,
        ДЕФНЕТ		= 0x00000080,

        ИКВОСКЛИЦАНИЕ 	= 0x00000100,
        ИКРУКА		= 0x00000200,
        ИКПРЕДУПРЕЖДЕНИЕ	= ИКВОСКЛИЦАНИЕ,
        ИКОШИБКА		= ИКРУКА,
        ИКВОПРОС	= 0x00000400,
        ИКИНФО	= 0x00000800,
        ИКСТОП		= ИКРУКА,
        ИКЗВЕЗДА	= ИКИНФО,
        ИКМАСКА		= (0x00000100|0x00000200|0x00000400|0x00000800),

        ВПЕРЁД		= 0x00001000,
        НАЗАД		= 0x00002000,
        СБРОС		= 0x00004000,
        ПОМОЩЬ		= 0x00008000,
        ЕЩЁ 		= 0x00010000,
        СЕТАП		= 0x00020000,
    }

    //---------------------------------------------------------------------
    const ткст СтрИмениДиалога="dialog";

    public this(ЦелУкз вхобъ);
    public this();
    public this(Окно родитель, цел ид, ткст титул, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=ДЕФ_СТИЛЬ_ДИАЛОГА, ткст имя=СтрИмениДиалога);
    public this(Окно родитель, ткст титул, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=ДЕФ_СТИЛЬ_ДИАЛОГА, ткст имя=СтрИмениДиалога);
    public бул создай(Окно окно, цел ид, ткст титул, inout Точка поз,
                               inout Размер размер, цел стиль, ткст имя);
    public цел кодВозврата();
    public проц кодВозврата(цел значение);
    public override ткст титул();
    public override проц титул(ткст значение);
    public проц завершиМодально(цел возврКод);
    public проц устИконку(Пиктограмма пиктограмма);
    public  цел покажиМодально();
    public бул модален();
}
