
module wx.ImageHandlers;
public import wx.common;
public import wx.Image;

//-------------------------------------------
extern(D) class БМПОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ИКООбработчик : БМПОбработчик
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class КУРОбработчик : ИКООбработчик
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class АНИОбработчик : КУРОбработчик
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ПНГОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ГИФОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ПЦХОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ДжПЕГОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ПНМОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ХПМОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------
extern(D) class ТИФФОбработчик : ОбработчикРисунка
{
    public this(ЦелУкз укз);
    public this();
}
//-------------------------------------------