module wx.MemoryDC;
public import wx.common;
public import wx.DC;

//---------------------------------------------------------------------

extern(D) class КУПамяти : КУОкна
{
    public this(ЦелУкз вхобъ);
    public this();
    public this(КонтекстУстройства ку);
    public проц выделиОбъект(Битмап битмап);
}
//---------------------------------------------------------------------

extern(D) class КУБуферированный : КУПамяти
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public this();
    public this(КонтекстУстройства ку, Битмап битмап);
    public this(КонтекстУстройства ку, Размер размер);
    public проц иницПоБитмапу(КонтекстУстройства ку, Битмап битмап);
    public проц иницПоРазмеру(КонтекстУстройства ку, Размер зона);
    public проц снимиМаску();
}

//---------------------------------------------------------------------

extern(D) class КУРисованияБуферированный : КУБуферированный
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public this(Окно окно, Битмап буфер);
}
//---------------------------------------------------------------------