module wx.MouseEvent;
public import wx.common;
public import wx.Event;

public import wx.DC;

//-------------------------------------------

extern(D) class СобытиеМыши : Событие
{
    public this(ЦелУкз вхобъ);
    public this(ТипСобытия типМыши);
    public бул кнопка_ли();
    public бул кнопкаВнизу();
    public бул кнопкаВнизу(ПКнопкаМыши кноп);
    public бул кнопкаДНажата();
    public бул кнопкаДНажата(ПКнопкаМыши кноп);
    public бул кнокпаВверху();
    public бул кнокпаВверху(ПКнопкаМыши кноп);
    public бул кнопка(цел кноп);
    public бул кнопкаВнизу_ли(цел кноп);
    public цел кнопка();
    public бул контролВнизу();
    public бул метаВнизу();
    public бул альтВнизу();
    public бул шифтВнизу();
    public бул леваяВнизу();
    public бул средняяВнизу();
    public бул праваяВнизу();
    public бул леваяВверху();
    public бул средняяВверху();
    public бул праваяВверху();
    public бул леваяДНажата();
    public бул средняяДНажата();
    public бул праваяДНажата();
    public бул леваяВнизу_ли();
    public бул средняяВнизу_ли();
    public бул праваяВнизу_ли();
    public бул перетягивание();
    public бул движение();
    public бул вхождение();
    public бул покидание();
    public Точка позиция();
    public Точка логичПоз(КонтекстУстройства ку);
    public цел вращениеКолеса();
    public цел дельтаКолеса();
    public цел строкНаДействие();
    public бул промоткаСтраницы_ли();
    //private static Событие Нов(ЦелУкз объ);
    // //static this();
}
//-------------------------------------------

