module wx.SashWindow;
public import wx.common;
public import wx.Window;
public import wx.CommandEvent;

public enum ППозицияКраяСаша
{
    Верх = 0,
    Право,
    Низ,
    Лево,
    Нет = 100
}

//-----------------------------------------------------------------------------

public enum ПСтатусТягаСаша
{
    Ок,
    ВнеДиапазона
}

//-----------------------------------------------------------------------------
extern(D) class КрайСаша : ВизОбъект
{
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public this();
    ~this();
    public бул m_show();
    public бул m_border();
    public цел m_margin();
}
//-----------------------------------------------------------------------------
extern(D) class СашОкно : Окно
{
    enum
    {
        БЕЗ_БОРДЮРА	= 0x0000,
        БОРДЮР	= 0x0020,
        САШ3Д	= 0x0040,
        БОРДЮР3Д	= 0x0080,
        С3Д	= САШ3Д | БОРДЮР3Д,
    }
    enum
    {
        ТЯГ_НЕТ	= 0,
        ТЯГ_ТЯНЕТ	= 1,
        ТЯГ_ВЛЕВО_ВНИЗ	= 2,
    }

    public this(ЦелУкз вхобъ);
    public this();
    public this(Окно родитель, цел ид /*= ЛЮБОЙ*/, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=С3Д|КЛИП_ОТПРЫСКИ, ткст имя="sashWindow");
    public this(Окно родитель, Точка поз=ДЕФПОЗ, Размер размер=ДЕФРАЗМ, цел стиль=С3Д|КЛИП_ОТПРЫСКИ, ткст имя="sashWindow");
    public бул создай(Окно родитель, цел ид, inout Точка поз, inout Размер размер, цел стиль, ткст имя);
    public проц устСашВидимым(ППозицияКраяСаша край, бул sash);
    public бул дайСашВидимый(ППозицияКраяСаша край);
    public проц устБордюрСаша(ППозицияКраяСаша край, бул бордюр);
    public цел дайМаржинКрая(ППозицияКраяСаша край);
    public цел дефРазмБордюра();
    public проц дефРазмБордюра(цел значение);
    public цел внешнРазмБордюра();
    public проц внешнРазмБордюра(цел значение);
    public цел минРазмХ();
    public проц минРазмХ(цел значение);
    public цел минРазмУ();
    public проц минРазмУ(цел значение);
    public цел максРазмХ();
    public проц максРазмХ(цел значение);
    public цел максРазмУ();
    public проц максРазмУ(цел значение);
}
//-----------------------------------------------------------------------------
extern(D) class СобытиеСаш : СобытиеКоманды
{
    public this(ЦелУкз вхобъ);
    public this();
    public this(цел ид);
    public this(цел ид, ППозицияКраяСаша край);
    public ППозицияКраяСаша край();
    public проц край(ППозицияКраяСаша значение);
    public Прямоугольник прямТяга();
    public проц прямТяга(Прямоугольник значение);
    public ПСтатусТягаСаша статусТяга();
    public проц статусТяга(ПСтатусТягаСаша значение);
    //private static Событие Нов(ЦелУкз объ);
    //static this();
}
