module wx.Sound;
public import wx.common;

//---------------------------------------------------------------------------
// Константы для Звук.играй
//---------------------------------------------------------------------------

const бцел СИНХ = 0U;
const бцел АСИНХ = 1U;
const бцел ЦИКЛ = 2U;

//-----------------------------------------------------------------------------

extern(D) class Звук : ВизОбъект
{

    public this();
    public this(ткст имяф, бул ресурс_ли=нет);
    public this(ббайт[] данные);
    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    ~this();
    public бул играй(бцел флаги=АСИНХ);
    public проц стоп();
    public бул Ок();
    static бул играй(ткст имяф, бцел флаги=АСИНХ);

}
