module wx.SpinCtrl;
public import wx.common;
public import wx.Control;

//---------------------------------------------------------------------
extern(D) class СпинКтрл : Контрол
{
    public const цел ГОРИЗОНТАЛЬНАЯ       = ПОриентация.Горизонталь;
    public const цел ВЕРТИКАЛЬНАЯ         = ПОриентация.Вертикаль;
    public const цел КЛЮЧИ_СТРЕЛКИ       = 0x1000;
    public const цел РЭП             = 0x2000;

    public this(ЦелУкз вхобъ);
    public this();
    public this(Окно родитель,
                цел ид /*= ЛЮБОЙ*/,
                ткст значение = "",
                Точка поз = ДЕФПОЗ,
                Размер размер = ДЕФРАЗМ,
                цел стиль = КЛЮЧИ_СТРЕЛКИ,
                цел мин = 0, цел макс = 100, цел исходн = 0,
                ткст имя = "СпинКтрл");
    //public static ВизОбъект Нов(ЦелУкз вхобъ);
    public this(Окно родитель,
                ткст значение = "",
                Точка поз = ДЕФПОЗ,
                Размер размер = ДЕФРАЗМ,
                цел стиль = КЛЮЧИ_СТРЕЛКИ,
                цел мин = 0, цел макс = 100, цел исходн = 0,
                ткст имя = "СпинКтрл");
    public бул создай(Окно родитель, цел ид, ткст значение, Точка поз, Размер размер, цел стиль, цел мин, цел макс, цел исходн, ткст имя);
    public цел значение();
    public проц значение(цел значение);
    public проц устЗнач(ткст знач);
    public цел макс();
    public цел мин();
    public проц устДиапазон(цел мин, цел макс);
    public override проц UpdateUI_Add(ДатчикСобытий значение);
    public override проц UpdateUI_Remove(ДатчикСобытий значение);
}

