module wx.StatusBar;
public import wx.common;
public import wx.Window;


public const цел wxST_SIZEGRIP         = 0x0010;
public const цел БЕЗ_АВТОПЕРЕМЕРА    = 0x0001;

public const цел wxSB_NORMAL	= 0x000;
public const цел wxSB_FLAT	= 0x001;
public const цел wxSB_RAISED	= 0x002;

//-----------------------------------------------------------------------------

extern(D) class СтрокаСостояния : Окно
{
    public this(ЦелУкз вхобъ);
    public this();
    public this(Окно родитель, цел ид /*= ЛЮБОЙ*/, цел стиль = wxST_SIZEGRIP, ткст имя="");
    public this(Окно родитель, цел стиль = wxST_SIZEGRIP, ткст имя="");
    public бул создай(Окно родитель, цел ид, цел стиль, ткст имя);
    public проц устСчётПолей(цел число, цел[] ширины);
    public цел счётПолей();
    public цел бордюрУ();
    public цел бордюрХ();
    public бул дайПрямПоля(цел i, inout Прямоугольник прям);
    public проц текстСтатуса(ткст значение);
    public ткст текстСтатуса();
    public проц устТекстСтатуса(ткст текст);
    public проц устТекстСтатуса(ткст текст, цел число);
    public ткст дайТекстСтатуса(цел число);
    public проц шириныСтатуса(цел[] значение);
    public проц устШириныСтатуса(цел ч, цел* ширины);
    public проц выньТекстСтатуса();
    public проц выньТекстСтатуса(цел поле);
    public проц суньТекстСтатуса(ткст хткст);
    public проц суньТекстСтатуса(ткст хткст, цел поле);
    public проц минВысь(цел значение);
    public проц стилиСтатуса(цел[] значение);
}

