module wx.Utils;
public import wx.common;
public import wx.Window;


public static ткст визДайДомПапку();
public static ткст визДайТРП();
public static проц визСпи(цел чис);
public static проц визМиллиСпи(цел чис);
public static проц визМикроСпи(цел чис);
public static проц визЖни();
public static проц стартКурсорЗанят();
public static проц стопКурсорЗанят();
public static проц войдиВГипМютекс();
public static проц покиньГипМютекс();

//---------------------------------------------------------------------

extern(D) class КурсорЗанят : ИВымещаемый
{
    //private бул вымещен = нет;
    public this();
    ~this();
    public проц вымести();
}

//---------------------------------------------------------------------

public scope class ДезактиваторОкна : ВизОбъект
{
    //---------------------------------------------------------------------

    public this(ЦелУкз вхобъ);
    //private this(ЦелУкз вхобъ, бул памСобств);
    public this();
    public this(Окно winToSkip);
    ~this();
}

//---------------------------------------------------------------------

public scope class ИнфоЗанят : ВизОбъект
{
    //---------------------------------------------------------------------

    public this(ЦелУкз вхобъ);
    public this(ткст сообщение);
    public this(ткст сообщение, Окно родитель);
    //private this(ЦелУкз вхобъ, бул памСобств);
    ~this();
}

//---------------------------------------------------------------------
