
module io.stream.DataFile;

private import io.device.File;

private import io.stream.Data;

/*******************************************************************************

        Составляет поисковозможный файл с буферируемым бинарным вводом.
         Метод "сместись" приводит к очистке буфера.

*******************************************************************************/

extern(D):

 class ВводФайлаДанных : ВводДанных
{
   // private Файл провод;

    /***********************************************************************

            Составляет ФайлПоток.

    ***********************************************************************/

    this (ткст путь, Файл.Стиль стиль = Файл.ЧитСущ);

    /***********************************************************************

            Оборачивает экземпляр Файл.

    ***********************************************************************/

    this (Файл файл);

    /***********************************************************************

           Возвращает низлежащий провод.

    ***********************************************************************/

    final Файл файл ();
}


/*******************************************************************************

        Составляет просматриваемый файл с буферируемым двоичным выводом. 
		Метод сместись в начале вызывает слив буфера.

*******************************************************************************/

class ВыводФайлаДанных : ВыводДанных
{
   // private Файл провод;

    /***********************************************************************

            Составить ФайлПоток.

    ***********************************************************************/

    this (ткст путь, Файл.Стиль стиль = Файл.ЗапСозд);

    /***********************************************************************

            Обмотать экземпляр ФайлПровода.

    ***********************************************************************/

    this (Файл файл);

    /***********************************************************************

            Возвращает нижележащий провод.

    ***********************************************************************/

    final Файл файл ();
}

debug (DataFile)
{
    import io.Stdout;
	import io.stream.DataFile;

    проц main()
    {
        auto myFile = new ВыводФайлаДанных("Hello.txt");
        myFile.пиши("какой-то текст");
        myFile.слей;
        Стдвыв.форматнс ("{}:{}", myFile.файл.позиция, myFile.сместись(myFile.Якорь.Тек));
    }
}
