module io.stream.Snoop;

private import  io.Console,
                io.device.Conduit;

private import  text.convert.Format;

private alias проц delegate(ткст) Снуп;


/*******************************************************************************

        Поток для демонмтрации поведения вызова. По умолчанию трассировка
		активности направляется на Кош.

*******************************************************************************/

extern(D) class СнупВвод : ИПотокВвода
{
       // private ИПотокВвода     хост;
       // private Снуп           snoop;

        /***********************************************************************

                Прикрепить к предоставленному потоку.

        ***********************************************************************/

        this (ИПотокВвода хост, Снуп snoop = пусто);

        /***********************************************************************

                Вернуть вышележащий хост этого фильтра.
                        
        ***********************************************************************/

        ИПотокВвода ввод ();

        /***********************************************************************

                Вернуть хостинговый провод.

        ***********************************************************************/

        final ИПровод провод ();

        /***********************************************************************

                Читает из провода в целевой массив. Предоставленный приёмник 
                заполняется содержимым из этого провода. 

                Возвращает число считанных байтов, которое может быть меньше
                затребованного в приёмн.

        ***********************************************************************/

        final т_мера читай (проц[] приёмн);

        /***********************************************************************

                Загружает биты из потока, и возвращает их все в массив.
                Массив-приёмник может предоставляться как опция, которая -
                при необходимости - будет развёрнута для использования ввода.

                Возвращает массив, представляющий контент, выбрасывает
                ВВИскл при ошибке.
                              
        ***********************************************************************/

        проц[] загрузи (т_мера max=-1);

        /***********************************************************************

                Очищает любой буферированный контент.

        ***********************************************************************/

        final ИПотокВвода слей ();

        /***********************************************************************

                Закрывает ввод.

        ***********************************************************************/

        final проц закрой ();

        /***********************************************************************
        
                Перемещение по этому потоку. Целевые проводы, не поддерживаюшие
                перемещения по ним, выбросят ВВИскл.

        ***********************************************************************/

        final дол сместись (дол смещение, Якорь якорь = Якорь.Нач);

        /***********************************************************************

                Внутренний обработчик трассировки.

        ***********************************************************************/

        private проц снупер (ткст x);

        /***********************************************************************

                Внутренний обработчик трассировки.

        ***********************************************************************/

        private проц след (ткст формат, ...);
}


/*******************************************************************************

        Поток для демонмтрации поведения вызова. По умолчанию трассировка
		активности направляется на Кош.

*******************************************************************************/

class СнупВывод : ИПотокВывода
{
       // private ИПотокВывода    хост;
      //  private Снуп           snoop;

        /***********************************************************************

                Прикрепить к предоставленному потоку.

        ***********************************************************************/

        this (ИПотокВывода хост, Снуп snoop = пусто);

        /***********************************************************************
        
                Возвращает апстримный хост этого фильтра.
                        
        ***********************************************************************/

        ИПотокВывода вывод ();

        /***********************************************************************

                Записывает в провод из массива-истока. Содержимое
				предоставленного ист записывается в этот провод.

                Возвращает число байтов, записаных из ист, которое
				может быть меньше предоставленного количества.

        ***********************************************************************/

        final т_мера пиши (проц[] ист);

        /***********************************************************************

                Возвращает хостинговый провод.

        ***********************************************************************/

        final ИПровод провод ();

        /***********************************************************************

                Эммитировать/испустить буферированный контент.

        ***********************************************************************/

        final ИПотокВывода слей ();

        /***********************************************************************

                Закрыть этот вывод.

        ***********************************************************************/

        final проц закрой ();

        /***********************************************************************

                Направить контент другого провода в этот. Возвращает
                ссылку на этот класс, либо выбрасывает ВВИскл при неуспехе.

        ***********************************************************************/

        final ИПотокВывода копируй (ИПотокВвода ист, т_мера max=-1);

        /***********************************************************************
        
                Смещение по этому потоку. Целевые проводы, не поддерживаюшие
                перемещения по ним, выбросят ВВИскл.

        ***********************************************************************/

        final дол сместись (дол смещение, Якорь якорь = Якорь.Нач);

      //  /***********************************************************************

       //         Внутренний обработчик трассировки.

    //    ***********************************************************************/

      //  private проц снупер (ткст x);

    //    /***********************************************************************

     //           Внутренний обработчик трассировки.

     //   ***********************************************************************/

       // private проц след (ткст форматируй, ...);
}



debug (Снуп)
{
        проц main()
        {
                auto s = new СнупВвод (пусто);
                auto o = new СнупВывод (пусто);
        }
}
