/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. Все права защищены

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: April 2004

        author:         Kris

*******************************************************************************/

module net.model.UriView;

/*******************************************************************************

       Реализует совместимую с RFC 2396 спецификацию URI. Смотрите
        <A HREF="http://ftp.ics.uci.edu/pub/ietf/уир/rfc2396.txt">эту страницу</A>
        для дополнительной информации.

        The implementation fails the spec on two counts: it doesn't insist
        on a схема being present in the ОбзорУИР, и it doesn't implement the
        "Relative References" support noted in section 5.2.

        Note that IRI support can be implied by assuming each of инфОПользователе, путь,
        запрос, и фрагмент are UTF-8 кодирован
        (see <A HREF="http://www.w3.org/2001/Talks/0912-IUC-IRI/paper.html">
        this страница</A> for further details).

        Use a Уир instead where you need в_ alter specific уир атрибуты.

*******************************************************************************/

abstract class ОбзорУИР
{
    public alias порт        дайПорт;
    public alias дефолтнПорт дайДефолтнПорт;
    public alias схема      дайСхему;
    public alias хост        дайХост;
    public alias валКЦЕПорт   дайВалидныйПорт;
    public alias инфОПользователе    дайИнфОПользователе;
    public alias путь        дайПуть;
    public alias запрос       дайЗапрос;
    public alias фрагмент    дайФрагмент;
    public alias порт        устПорт;
    public alias схема      устСхему;
    public alias хост        устХост;
    public alias инфОПользователе    устИнфОПользователе;
    public alias запрос       устЗапрос;
    public alias путь        установиПуть;
    public alias фрагмент    устФрагмент;

    public enum {InvalКСЕРort = -1}

    /***********************************************************************

            Возвращает default порт для заданного схема. InvalКСЕРort
            is returned if the схема is неизвестное, либо does not прими
            a порт.

    ***********************************************************************/

    abstract цел дефолтнПорт (ткст схема);

    /***********************************************************************

            Возвращает разобрано схема, либо пусто if the схема was not
            specified

    ***********************************************************************/

    abstract ткст схема();

    /***********************************************************************

            Возвращает разобрано хост, либо пусто if the хост was not
            specified

    ***********************************************************************/

    abstract ткст хост();

    /***********************************************************************

            Возвращает разобрано порт число, либо InvalКСЕРort if the порт
            was not предоставленный.

    ***********************************************************************/

    abstract цел порт();

    /***********************************************************************

            Возвращает действителен порт число by performing a отыщи on the
            known schemes if the порт was not explicitly specified.

    ***********************************************************************/

    abstract цел валКЦЕПорт();

    /***********************************************************************

            Возвращает разобрано инфОПользователе, либо пусто if инфОПользователе was not
            предоставленный.

    ***********************************************************************/

    abstract ткст инфОПользователе();

    /***********************************************************************

            Возвращает разобрано путь, либо пусто if the путь was not
            предоставленный.

    ***********************************************************************/

    abstract ткст путь();

    /***********************************************************************

            Возвращает разобрано запрос, либо пусто if a запрос was not
            предоставленный.

    ***********************************************************************/

    abstract ткст запрос();

    /***********************************************************************

            Возвращает разобрано фрагмент, либо пусто if a фрагмент was not
            предоставленный.

    ***********************************************************************/

    abstract ткст фрагмент();

    /***********************************************************************

            Return whether or not the ОбзорУИР схема is consопрered генерный.

    ***********************************************************************/

    abstract бул генерен_ли ();

    /***********************************************************************

            Emit the контент of this ОбзорУИР. Вывод is constructed per
            RFC 2396.

    ***********************************************************************/

    abstract ткст вТкст ();
}

