/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. Все права защищены

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: Oct 2007

        author:         Kris

*******************************************************************************/

module io.stream.Text;

private import io.stream.Lines;

private import io.stream.Format;

private import io.stream.Buffered;

private import io.model;

/*******************************************************************************

        Ввод буферируемый

*******************************************************************************/

class ТекстВвод : Строки!(сим)
{
    /**********************************************************************

    **********************************************************************/

    this (ИПотокВвода ввод)
    {
        super (ввод);
    }
}

/*******************************************************************************

        Вывод буферированный

*******************************************************************************/

class ТекстВывод : ФормВывод!(сим)
{
    /**********************************************************************

            Конструирует экземпляр ФормВывод, прикрепляя предоставленный поток
          к форматировщику выкладки.

    **********************************************************************/

    this (ИПотокВывода вывод)
    {
        super (Бвыв.создай(вывод));
    }
}
