module tstlay;
import stdrus: пз;
import text.convert.Layout;

проц main()
    {
        auto Форматировщик = Выкладка!(сим).экземпляр;

        // basic выкладка tests
        assert( Форматировщик( "abc" ) == "abc" );
        assert( Форматировщик( "{0}", 1 ) == "1" );
        assert( Форматировщик( "{0}", -1 ) == "-1" );

        assert( Форматировщик( "{}", 1 ) == "1" );
        assert( Форматировщик( "{} {}", 1, 2) == "1 2" );
        assert( Форматировщик( "{} {0} {}", 1, 3) == "1 1 3" );

        assert( Форматировщик( "{0}", да ) == "да", Форматировщик( "{0}", да ));
        assert( Форматировщик( "{0}", нет ) == "нет" );

        assert( Форматировщик( "{0}", cast(байт)-128 ) == "-128" );
        assert( Форматировщик( "{0}", cast(байт)127 ) == "127" );
        assert( Форматировщик( "{0}", cast(ббайт)255 ) == "255" );

        assert( Форматировщик( "{0}", cast(крат)-32768  ) == "-32768" );
        assert( Форматировщик( "{0}", cast(крат)32767 ) == "32767" );
        assert( Форматировщик( "{0}", cast(бкрат)65535 ) == "65535" );
        assert( Форматировщик( "{0:x4}", cast(бкрат)0xafe ) == "0afe" );
        assert( Форматировщик( "{0:X4}", cast(бкрат)0xafe ) == "0AFE" );

        assert( Форматировщик( "{0}", -2147483648 ) == "-2147483648" );
        assert( Форматировщик( "{0}", 2147483647 ) == "2147483647" );
        assert( Форматировщик( "{0}", 4294967295 ) == "4294967295" );

        // large целыйs
        assert( Форматировщик( "{0}", -9223372036854775807L) == "-9223372036854775807" );
        assert( Форматировщик( "{0}", 0x8000_0000_0000_0000L) == "9223372036854775808" );
        assert( Форматировщик( "{0}", 9223372036854775807L ) == "9223372036854775807" );
        assert( Форматировщик( "{0:X}", 0xFFFF_FFFF_FFFF_FFFF) == "FFFFFFFFFFFFFFFF" );
        assert( Форматировщик( "{0:x}", 0xFFFF_FFFF_FFFF_FFFF) == "ffffffffffffffff" );
        assert( Форматировщик( "{0:x}", 0xFFFF_1234_FFFF_FFFF) == "ffff1234ffffffff" );
        assert( Форматировщик( "{0:x19}", 0x1234_FFFF_FFFF) == "00000001234ffffffff" );
        assert( Форматировщик( "{0}", 18446744073709551615UL ) == "18446744073709551615" );
        assert( Форматировщик( "{0}", 18446744073709551615UL ) == "18446744073709551615" );

        // fragments перед и после
        assert( Форматировщик( "d{0}d", "s" ) == "dsd" );
        assert( Форматировщик( "d{0}d", "1234567890" ) == "d1234567890d" );

        // brace escaping
        assert( Форматировщик( "d{0}d", "<ткст>" ) == "d<ткст>d");
        assert( Форматировщик( "d{{0}d", "<ткст>" ) == "d{0}d");
        assert( Форматировщик( "d{{{0}d", "<ткст>" ) == "d{<ткст>d");
        assert( Форматировщик( "d{0}}d", "<ткст>" ) == "d<ткст>}d");

        // hex conversions, where ширина indicates leading zeroes
        assert( Форматировщик( "{0:x}", 0xafe0000 ) == "afe0000" );
        assert( Форматировщик( "{0:x7}", 0xafe0000 ) == "afe0000" );
        assert( Форматировщик( "{0:x8}", 0xafe0000 ) == "0afe0000" );
        assert( Форматировщик( "{0:X8}", 0xafe0000 ) == "0AFE0000" );
        assert( Форматировщик( "{0:X9}", 0xafe0000 ) == "00AFE0000" );
        assert( Форматировщик( "{0:X13}", 0xafe0000 ) == "000000AFE0000" );
        assert( Форматировщик( "{0:x13}", 0xafe0000 ) == "000000afe0000" );

        // десяток ширина
        assert( Форматировщик( "{0:d6}", 123 ) == "000123" );
        assert( Форматировщик( "{0,7:d6}", 123 ) == " 000123" );
        assert( Форматировщик( "{0,-7:d6}", 123 ) == "000123 " );

        // ширина & знак combinations
        assert( Форматировщик( "{0:d7}", -123 ) == "-0000123" );
        assert( Форматировщик( "{0,7:d6}", 123 ) == " 000123" );
        assert( Форматировщик( "{0,7:d7}", -123 ) == "-0000123" );
        assert( Форматировщик( "{0,8:d7}", -123 ) == "-0000123" );
        assert( Форматировщик( "{0,5:d7}", -123 ) == "-0000123" );

        // Negative numbers in various bases
        assert( Форматировщик( "{:b}", cast(байт) -1 ) == "11111111" );
        assert( Форматировщик( "{:b}", cast(крат) -1 ) == "1111111111111111" );
        assert( Форматировщик( "{:b}", cast(цел) -1 )
        == "11111111111111111111111111111111" );
        assert( Форматировщик( "{:b}", cast(дол) -1 )
        == "1111111111111111111111111111111111111111111111111111111111111111" );

        assert( Форматировщик( "{:o}", cast(байт) -1 ) == "377" );
        assert( Форматировщик( "{:o}", cast(крат) -1 ) == "177777" );
        assert( Форматировщик( "{:o}", cast(цел) -1 ) == "37777777777" );
        assert( Форматировщик( "{:o}", cast(дол) -1 ) == "1777777777777777777777" );

        assert( Форматировщик( "{:d}", cast(байт) -1 ) == "-1" );
        assert( Форматировщик( "{:d}", cast(крат) -1 ) == "-1" );
        assert( Форматировщик( "{:d}", cast(цел) -1 ) == "-1" );
        assert( Форматировщик( "{:d}", cast(дол) -1 ) == "-1" );

        assert( Форматировщик( "{:x}", cast(байт) -1 ) == "ff" );
        assert( Форматировщик( "{:x}", cast(крат) -1 ) == "ffff" );
        assert( Форматировщик( "{:x}", cast(цел) -1 ) == "ffffffff" );
        assert( Форматировщик( "{:x}", cast(дол) -1 ) == "ffffffffffffffff" );

        // аргумент индекс
        assert( Форматировщик( "a{0}b{1}c{2}", "x", "y", "z" ) == "axbycz" );
        assert( Форматировщик( "a{2}b{1}c{0}", "x", "y", "z" ) == "azbycx" );
        assert( Форматировщик( "a{1}b{1}c{1}", "x", "y", "z" ) == "aybycy" );

        // alignment does not ограничь the length
        assert( Форматировщик( "{0,5}", "hellohello" ) == "hellohello" );

        // alignment fills with пробелы
        assert( Форматировщик( "->{0,-10}<-", "hello" ) == "->hello     <-" );
        assert( Форматировщик( "->{0,10}<-", "hello" ) == "->     hello<-" );
        assert( Форматировщик( "->{0,-10}<-", 12345 ) == "->12345     <-" );
        assert( Форматировщик( "->{0,10}<-", 12345 ) == "->     12345<-" );

        // chop at maximum specified length; вставь ellИПses when chopped
        assert( Форматировщик( "->{.5}<-", "hello" ) == "->hello<-" );
        assert( Форматировщик( "->{.4}<-", "hello" ) == "->hell...<-" );
        assert( Форматировщик( "->{.-3}<-", "hello" ) == "->...llo<-" );

        // ширина определитель indicates число of десяток places
        assert( Форматировщик( "{0:f}", 1.23f ) == "1.23" );
        assert( Форматировщик( "{0:f4}", 1.23456789L ) == "1.2346" );
        assert( Форматировщик( "{0:e4}", 0.0001) == "1.0000e-04");

        assert( Форматировщик( "{0:f}", 1.23f*1i ) == "1.23*1i");
        assert( Форматировщик( "{0:f4}", 1.23456789L*1i ) == "1.2346*1i" );
        assert( Форматировщик( "{0:e4}", 0.0001*1i) == "1.0000e-04*1i");

        assert( Форматировщик( "{0:f}", 1.23f+1i ) == "1.23+1.00*1i" );
        assert( Форматировщик( "{0:f4}", 1.23456789L+1i ) == "1.2346+1.0000*1i" );
        assert( Форматировщик( "{0:e4}", 0.0001+1i) == "1.0000e-04+1.0000e+00*1i");
        assert( Форматировщик( "{0:f}", 1.23f-1i ) == "1.23-1.00*1i" );
        assert( Форматировщик( "{0:f4}", 1.23456789L-1i ) == "1.2346-1.0000*1i" );
        assert( Форматировщик( "{0:e4}", 0.0001-1i) == "1.0000e-04-1.0000e+00*1i");

        // 'f.' & 'e.' форматируй truncates zeroes из_ floating десятки
        assert( Форматировщик( "{:f4.}", 1.230 ) == "1.23" );
        assert( Форматировщик( "{:f6.}", 1.230 ) == "1.23" );
        assert( Форматировщик( "{:f1.}", 1.230 ) == "1.2" );
        assert( Форматировщик( "{:f.}", 1.233 ) == "1.23" );
        assert( Форматировщик( "{:f.}", 1.237 ) == "1.24" );
        assert( Форматировщик( "{:f.}", 1.000 ) == "1" );
        assert( Форматировщик( "{:f2.}", 200.001 ) == "200");

        // Массив вывод
        цел[] a = [ 51, 52, 53, 54, 55 ];
        assert( Форматировщик( "{}", a ) == "[51, 52, 53, 54, 55]" );
        assert( Форматировщик( "{:x}", a ) == "[33, 34, 35, 36, 37]" );
        assert( Форматировщик( "{,-4}", a ) == "[51  , 52  , 53  , 54  , 55  ]" );
        assert( Форматировщик( "{,4}", a ) == "[  51,   52,   53,   54,   55]" );
        цел[][] b = [ [ 51, 52 ], [ 53, 54, 55 ] ];
        assert( Форматировщик( "{}", b ) == "[[51, 52], [53, 54, 55]]" );

        бкрат[3] c = [ cast(бкрат)51, 52, 53 ];
        assert( Форматировщик( "{}", c ) == "[51, 52, 53]" );

        // целое AA
        бкрат[дол] d;
        d[234] = 2;
        d[345] = 3;
        assert( Форматировщик( "{}", d ) == "{234 => 2, 345 => 3}" ||
        Форматировщик( "{}", d ) == "{345 => 3, 234 => 2}");

        // бул/ткст AA
        бул[ткст] e;
        e[ "ключ".dup ] = да;
        e[ "значение".dup ] = нет;
        assert( Форматировщик( "{}", e ) == "{ключ => да, значение => нет}" ||
        Форматировщик( "{}", e ) == "{значение => нет, ключ => да}");

        // ткст/дво AA
        ткст[ дво ] f;
        f[ 1.0 ] = "one".dup;
        f[ 3.14 ] = "ПИ".dup;
        assert( Форматировщик( "{}", f ) == "{1.00 => one, 3.14 => ПИ}" ||
        Форматировщик( "{}", f ) == "{3.14 => ПИ, 1.00 => one}");
		
		assert( Форматировщик( "{} {0} {} {}", 1, 3) == "1 1 3 {неверный индекс}" );
        assert( Форматировщик( "{} {0} {} {:x}", 1, 3) == "1 1 3 {неверный индекс}" );
		скажинс("Да без проблем всё проходит....");
		пз;
    }